package com.onix.internship.data

class DialogueList {
    val startDialog =
        listOf(
            "Только когда я услышал шорох ног и сумок, я понял, что лекция кончилась.",
            "Лекции профессора Эйлин обычно интересные, но сегодня я просто не смог сконцентрироваться.",
            "У меня было много разных мыслей в голове… и все эти мысли кульминировались вопросом.",
            "Вопросом, который я давно хотел задать определённому человеку.",

            "Когда мы вышли из университета, я тут же заметил её.",
            "Я знал Сильви ещё с тех лет, когда мы были детьми. У неё большое сердце и она всегда была мне хорошим другом.",
            "Но в последнее время… Я почувствовал, что мне хочется чего-то большего.",
            "Как только она встретилась со мной взглядом, я решил…"
        )
    val rightAwayDialog = listOf(
        "Привет! Как тебе урок?",
        "Хорошо…",
        "Я не мог собраться и признать, что весь он сначала влетел в одно ухо, а затем вылетел в другом.",
        "Ты сейчас идёшь домой? Хочешь пройтись вместе со мной?",
        "Конечно!",

        "Через некоторое время мы дошли до луга, начинавшегося за нашим родным городом, в котором мы жили.",
        "Здесь живописный вид, к которому я уже привык. Осень здесь была особенно прекрасна.",
        "Когда мы были детьми, мы много играли на этих лугах. Так много здесь воспоминаний.",
        "Эй… Эмм…",

        "Она повернулась ко мне и улыбнулась. Она выглядела настолько дружелюбной, что вся моя нервозность улетучилась.",
        "Я спрошу её..!",
        "Эммм… Хотела бы ты…",
        "Хотела бы ты стать художницей моей визуальной новеллы?",

        "Тишина.",
        "Она выглядела столь шокированной, что я начал бояться худшего. Но затем…",

        "Конечно, но что такое \"визуальная новелла\"?"
    )
    val bookIsChoiceDialog = listOf(
        "Это как интерактивная книга, которую ты можешь читать на компьютере или консоли.",

        "Интерактивная?",
        "Ты можешь делать выборы, которые ведут к различным событиям и концовкам истории.",
        "А когда в дело вступает \"визуальная\" часть?",
        "В визуальных новеллах есть картинки и даже музыка, звуковые эффекты, и иногда озвучка, которая идёт наравне с текстом.",

        "Ясно! Это определённо кажется весёлым. Если честно, я раньше делала веб-комиксы, так что у меня есть много идей.",
        "Это отлично! Так… ты хочешь работать со мной в качестве художницы?",
        "Хочу!",
        "Отлично!"
    )

    val bookIsNotChoiceDialog = listOf(
        "Это вроде видеоигры, в которую ты можешь играть на своём компьютере или консоли.",
        "В визуальных новеллах рассказывается история с картинками и музыкой.",
        "Иногда ты также можешь делать выборы, которые влияют на конец истории.",
        "То есть это как те книги-игры?",
        "Точно! У меня есть много разных идей, которые, по-моему, могут сработать.",
        "И я думал, что ты могла бы помочь мне… так как я знаю, как тебе нравится рисовать.",
        "Мне одному будет трудно делать визуальную новеллу.",

        "Ну конечно! Я могу попытаться. Надеюсь, я тебя не разочарую.",
        "Сильви, ты же знаешь, ты никогда не сможешь меня разочаровать."
    )
    val merryDialog = listOf(
        "И так мы стали командой разработки визуальных новелл.",

        "За долгие годы мы сделали много игр, получив при этом много веселья.",
        "Наша первая игра была основана на одной из идей Сильви, но затем я начал давать и свои идеи.",
        "Мы по очереди придумывали истории и персонажей, и поддерживали друг друга в разработке отличных игр!",
        "И в один день…",

        "Эй…",
        "Да?",

        "Ты женишься на мне?",
        "Что? С чего это ты вдруг?",

        "Да ладно тебе, сколько мы уже встречаемся?",
        "Некоторое время…",

        "Последнюю пару лет мы делаем визуальные новеллы и проводим время вместе, помогаем друг другу…",
        "Я узнала тебя и заботилась о тебе больше, чем о ком-либо ещё. И я думаю, что ты чувствуешь то же самое, верно?",
        "Сильви…",

        "Но я знаю, что ты нерешительный. Если бы я сдержалась, кто знает, когда бы ты сделал мне предложение?",

        "Так ты женишься на мне?",
        "Конечно, я женюсь! На самом деле я действительно хотел сделать тебе предложение, клянусь!",
        "Я знаю, знаю.",
        "Думаю… Я просто слишком волновался о времени. Я хотел задать правильный вопрос в правильное время.",

        "Ты слишком сильно волнуешься. Если бы это была визуальная новелла, то я бы выбрала придать тебе смелости!",

        "Мы поженились вскоре после этого.",
        "Наш дуэт разработки жил и после нашей свадьбы… и я изо всех сил старался стать решительнее.",
        "Вместе мы жили долго и счастливо.",
        "{b}Хорошая концовка{/b}"
    )
    val laterDialog = listOf(
        "У меня не было сил собраться и спросить её в эту секунду. Сглотнув, я решил спросить её позже.",

        "Но я был нерешителен.",
        "Я не спросил у неё в тот день и не смог спросить больше никогда.",
        "Полагаю, теперь я никогда не узнаю ответ на мой вопрос…",
        "{b}Плохая концовка{/b}"
    )
}